# RectMullionWidth2 Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..RectMullionWidth2 Property
ParameterTypeId Class See Also
---
"Width on side 2"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId RectMullionWidth2 { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RectMullionWidth2 As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ RectMullionWidth2 {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace